In [124]:
import pandas as pd
import numpy as np
import os

In [125]:
sales =  pd.read_csv(r"/Users/rahulmeena/Imarticus/GitHub/IMARTICUS/Datasets/class_exercise/Car_sales.csv")

In [126]:
superstore = pd.read_excel(r"/Users/rahulmeena/Imarticus/GitHub/IMARTICUS/Datasets/class_exercise/Global Superstore.xls")

In [127]:
sales.head()

,Manufacturer,Model,Sales_in_thousands,four_year_resale_value,Vehicle_type,Price_in_thousands,Engine_size,Horsepower,Wheelbase,Width,Length,Curb_weight,Fuel_capacity,Fuel_efficiency,Latest_Launch,Power_perf_factor
0,Acura,Integra,16.919,16.360,Passenger,21.50,1.8,140.0,101.2,67.3,172.4,2.639,13.2,28.0,2/2/2012,58.280150
1,Acura,TL,39.384,19.875,Passenger,28.40,3.2,225.0,108.1,70.3,192.9,3.517,17.2,25.0,6/3/2011,91.370778
2,Acura,CL,14.114,18.225,Passenger,NaN,3.2,225.0,106.9,70.6,192.0,3.470,17.2,26.0,1/4/2012,NaN
3,Acura,RL,8.588,29.725,Passenger,42.00,3.5,210.0,114.6,71.4,196.6,3.850,18.0,22.0,3/10/2011,91.389779
4,Audi,A4,20.397,22.255,Passenger,23.99,1.8,150.0,102.6,68.2,178.0,2.998,16.4,27.0,10/8/2011,62.777639

In [128]:
sales.shape

(157, 16)

In [129]:
sales.columns

Index(['Manufacturer', 'Model', 'Sales_in_thousands', 'four_year_resale_value',
       'Vehicle_type', 'Price_in_thousands', 'Engine_size', 'Horsepower',
       'Wheelbase', 'Width', 'Length', 'Curb_weight', 'Fuel_capacity',
       'Fuel_efficiency', 'Latest_Launch', 'Power_perf_factor'],
      dtype='object')

In [130]:
sales.index

RangeIndex(start=0, stop=157, step=1)

In [131]:
sales.dtypes

Manufacturer               object
Model                      object
Sales_in_thousands        float64
four_year_resale_value    float64
Vehicle_type               object
Price_in_thousands        float64
Engine_size               float64
Horsepower                float64
Wheelbase                 float64
Width                     float64
Length                    float64
Curb_weight               float64
Fuel_capacity             float64
Fuel_efficiency           float64
Latest_Launch              object
Power_perf_factor         float64
dtype: object

In [132]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 157 entries, 0 to 156
Data columns (total 16 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Manufacturer            157 non-null    object
 1   Model                   157 non-null    object
 2   Sales_in_thousands      157 non-null    float64
 3   four_year_resale_value  121 non-null    float64
 4   Vehicle_type            157 non-null    object
 5   Price_in_thousands      155 non-null    float64
 6   Engine_size             156 non-null    float64
 7   Horsepower              156 non-null    float64
 8   Wheelbase               156 non-null    float64
 9   Width                   156 non-null    float64
 10  Length                  156 non-null    float64
 11  Curb_weight             155 non-null    float64
 12  Fuel_capacity           156 non-null    float64
 13  Fuel_efficiency         154 non-null    float64
 14  Latest_Launch           157 non-null    object
 15  Power_perf_factor       155 non-null    float64
dtypes: float64(12), object(4)
memory usage: 19.8+ KB

In [133]:
# Subset of Data
# 1. Row subset
# 2. Column subset
# 3. row and column subset
# 4. conditional subsetting
# Sampling
# Creating new columns
# Deleting columns
# Duplicate check and remove
# Missing value identification and treatment
# Sorting (order by - ascending or descending)
# Renamming
# Merging, concate and appending
# Statistics - mean, median, mode, count, std,
# Summary - pivot table, group by

### Subset of data

In [134]:
sales.columns

Index(['Manufacturer', 'Model', 'Sales_in_thousands', 'four_year_resale_value',
       'Vehicle_type', 'Price_in_thousands', 'Engine_size', 'Horsepower',
       'Wheelbase', 'Width', 'Length', 'Curb_weight', 'Fuel_capacity',
       'Fuel_efficiency', 'Latest_Launch', 'Power_perf_factor'],
      dtype='object')

In [135]:
sales.Price_in_thousands

0      21.50
1      28.40
2        NaN
3      42.00
4      23.99
       ...
152    24.40
153    27.50
154    28.80
155    45.50
156    36.00
Name: Price_in_thousands, Length: 157, dtype: float64

In [136]:
sales["Price_in_thousands"]

0      21.50
1      28.40
2        NaN
3      42.00
4      23.99
       ...
152    24.40
153    27.50
154    28.80
155    45.50
156    36.00
Name: Price_in_thousands, Length: 157, dtype: float64

In [137]:
sales[["Manufacturer", "Sales_in_thousands", "Engine_size"]]

    Manufacturer  Sales_in_thousands  Engine_size
0          Acura              16.919          1.8
1          Acura              39.384          3.2
2          Acura              14.114          3.2
3          Acura               8.588          3.5
4           Audi              20.397          1.8
..           ...                 ...          ...
152        Volvo               3.545          1.9
153        Volvo              15.245          2.4
154        Volvo              17.531          2.4
155        Volvo               3.493          2.3
156        Volvo              18.969          2.9

[157 rows x 3 columns]

In [138]:
# row and column extract

In [139]:
# sales.loc[] # it takes label as input
# sales.iloc[] # it takes index as input

In [140]:
sales.head()

,Manufacturer,Model,Sales_in_thousands,four_year_resale_value,Vehicle_type,Price_in_thousands,Engine_size,Horsepower,Wheelbase,Width,Length,Curb_weight,Fuel_capacity,Fuel_efficiency,Latest_Launch,Power_perf_factor
0,Acura,Integra,16.919,16.360,Passenger,21.50,1.8,140.0,101.2,67.3,172.4,2.639,13.2,28.0,2/2/2012,58.280150
1,Acura,TL,39.384,19.875,Passenger,28.40,3.2,225.0,108.1,70.3,192.9,3.517,17.2,25.0,6/3/2011,91.370778
2,Acura,CL,14.114,18.225,Passenger,NaN,3.2,225.0,106.9,70.6,192.0,3.470,17.2,26.0,1/4/2012,NaN
3,Acura,RL,8.588,29.725,Passenger,42.00,3.5,210.0,114.6,71.4,196.6,3.850,18.0,22.0,3/10/2011,91.389779
4,Audi,A4,20.397,22.255,Passenger,23.99,1.8,150.0,102.6,68.2,178.0,2.998,16.4,27.0,10/8/2011,62.777639

In [141]:
sales.iloc[4, 1]

'A4'

In [142]:
sales.iloc[3:7, 1:4]

  Model  Sales_in_thousands  four_year_resale_value
3    RL               8.588                  29.725
4    A4              20.397                  22.255
5    A6              18.780                  23.555
6    A8               1.380                  39.000

In [143]:
sales.iloc[[4, 7, 10, 100], [0, 1, 8, 9,10, 11]]

    Manufacturer    Model  Wheelbase  Width  Length  Curb_weight
4           Audi       A4      102.6   68.2   178.0        2.998
7            BMW     323i      107.3   68.4   176.0        3.179
10         Buick  Century      109.0   72.7   194.6        3.368
100   Mercedes-B  M-Class      111.0   72.2   180.6        4.387

In [144]:
sales.loc[4:8, "Model" : "Vehicle_type"]

  Model  Sales_in_thousands  four_year_resale_value Vehicle_type
4    A4              20.397                  22.255    Passenger
5    A6              18.780                  23.555    Passenger
6    A8               1.380                  39.000    Passenger
7  323i              19.747                     NaN    Passenger
8  328i               9.231                  28.675    Passenger

In [145]:
# Q1 get data for those vehicle which has a price if 20k or less
sales[sales["Price_in_thousands"] < 10]

,Manufacturer,Model,Sales_in_thousands,four_year_resale_value,Vehicle_type,Price_in_thousands,Engine_size,Horsepower,Wheelbase,Width,Length,Curb_weight,Fuel_capacity,Fuel_efficiency,Latest_Launch,Power_perf_factor
26,Chevrolet,Metro,21.855,5.16,Passenger,9.235,1.0,55.0,93.1,62.6,149.4,1.895,10.3,45.0,4/13/2012,23.276272
62,Hyundai,Accent,41.184,5.86,Passenger,9.699,1.5,92.0,96.1,65.7,166.7,2.240,11.9,31.0,9/10/2012,36.672284

In [146]:
# Q2 Get data for those vehicle which has horse power of 100
sales[sales["Horsepower"] == 100]

,Manufacturer,Model,Sales_in_thousands,four_year_resale_value,Vehicle_type,Price_in_thousands,Engine_size,Horsepower,Wheelbase,Width,Length,Curb_weight,Fuel_capacity,Fuel_efficiency,Latest_Launch,Power_perf_factor
129,Saturn,SL,80.620,9.20,Passenger,10.685,1.9,100.0,102.4,66.4,176.9,2.332,12.1,33.0,8/16/2012,39.986425
130,Saturn,SC,24.546,10.59,Passenger,12.535,1.9,100.0,102.4,66.4,180.0,2.367,12.1,33.0,3/16/2011,40.700072

In [147]:
# Q3 Please create the data for car only

In [148]:
sales[sales["Vehicle_type"] == "Car"]

,Manufacturer,Model,Sales_in_thousands,four_year_resale_value,Vehicle_type,Price_in_thousands,Engine_size,Horsepower,Wheelbase,Width,Length,Curb_weight,Fuel_capacity,Fuel_efficiency,Latest_Launch,Power_perf_factor
18,Cadillac,Escalade,14.785,NaN,Car,46.225,5.7,255.0,117.5,77.0,201.2,5.572,30.0,15.0,4/17/2012,109.509117
33,Chrysler,Town & Country,53.480,19.540,Car,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,7/13/2011,NaN
40,Dodge,Ram Pickup,227.061,15.060,Car,19.460,5.2,230.0,138.7,79.3,224.2,4.470,26.0,17.0,3/6/2012,90.211700
41,Dodge,Ram Wagon,16.767,15.510,Car,21.315,3.9,175.0,109.6,78.8,192.6,4.245,32.0,15.0,1/6/2012,71.135292
42,Dodge,Ram Van,31.038,13.425,Car,18.575,3.9,175.0,127.2,78.8,208.5,4.298,32.0,16.0,7/26/2012,70.078322
43,Dodge,Dakota,111.313,11.260,Car,16.980,2.5,120.0,131.0,71.5,215.0,3.557,22.0,19.0,11/25/2011,49.645002
44,Dodge,Durango,101.323,NaN,Car,26.310,5.2,230.0,115.7,71.7,193.5,4.394,25.0,17.0,6/27/2012,92.854125
45,Dodge,Caravan,181.749,12.025,Car,19.565,2.4,150.0,113.3,76.8,186.3,3.533,20.0,24.0,9/1/2011,61.227000
52,Ford,Explorer,276.747,16.640,Car,31.930,4.0,210.0,111.6,70.2,190.7,3.876,21.0,19.0,4/25/2012,87.635496
53,Ford,Windstar,155.787,13.175,Car,21.410,3.0,150.0,120.7,76.6,200.9,3.761,26.0,21.0,2/25/2012,62.095048
54,Ford,Expedition,125.338,23.575,Car,36.135,4.6,240.0,119.0,78.7,204.6,4.808,26.0,16.0,9/14/2012,100.024802
55,Ford,Ranger,220.650,7.850,Car,12.050,2.5,119.0,117.5,69.4,200.7,3.086,20.0,23.0,1/14/2012,47.389531
56,Ford,F-Series,540.561,15.075,Car,26.935,4.6,220.0,138.5,79.1,224.5,4.241,25.1,18.0,8/16/2012,89.401935
59,Honda,CR-V,73.203,17.710,Car,20.550,2.0,146.0,103.2,68.9,177.6,3.219,15.3,24.0,3/21/2012,60.087967
60,Honda,Passport,12.855,17.525,Car,26.600,3.2,205.0,106.4,70.4,178.2,3.857,21.1,19.0,10/9/2012,83.602501
61,Honda,Odyssey,76.029,19.490,Car,26.000,3.5,210.0,118.1,75.6,201.2,4.288,20.0,23.0,2/8/2012,85.217691
67,Jeep,Wrangler,55.557,13.475,Car,14.460,2.5,120.0,93.4,66.7,152.0,3.045,19.0,17.0,3/4/2012,48.672898
68,Jeep,Cherokee,80.556,13.775,Car,21.620,4.0,190.0,101.4,69.4,167.5,3.194,20.0,20.0,10/5/2012,76.584440
69,Jeep,Grand Cherokee,157.040,18.810,Car,26.895,4.0,195.0,105.9,72.3,181.5,3.880,20.5,19.0,12/10/2011,80.387779
74,Lexus,LX470,9.126,NaN,Car,60.105,4.7,230.0,112.2,76.4,192.5,5.401,25.4,15.0,10/30/2012,105.760458
75,Lexus,RX300,51.238,NaN,Car,34.605,3.0,220.0,103.0,71.5,180.1,3.900,17.2,21.0,1/4/2012,91.943802
78,Lincoln,Navigator,22.925,NaN,Car,42.660,5.4,300.0,119.0,79.9,204.8,5.393,30.0,15.0,12/23/2012,123.972047
84,Mitsubishi,Montero,11.337,19.125,Car,31.807,3.5,200.0,107.3,69.9,186.6,4.520,24.3,18.0,1/17/2012,83.920815
85,Mitsubishi,Montero Sport,39.348,13.880,Car,22.527,3.0,173.0,107.3,66.7,178.3,3.510,19.5,20.0,5/18/2012,70.660942
90,Mercury,Mountaineer,27.609,20.430,Car,27.560,4.0,210.0,111.6,70.2,190.1,3.876,21.0,18.0,2/13/2008,85.949744
91,Mercury,Villager,20.380,14.795,Car,22.510,3.3,170.0,112.2,74.9,194.7,3.944,20.0,21.0,10/20/2009,69.671461
100,Mercedes-B,M-Class,28.976,NaN,Car,35.300,3.2,215.0,111.0,72.2,180.6,4.387,19.0,20.0,2/10/2011,90.495532
104,Nissan,Quest,27.308,15.380,Car,26.399,3.3,170.0,112.2,74.9,194.8,3.991,20.0,21.0,3/7/2011,71.171664
105,Nissan,Pathfinder,42.574,17.810,Car,29.299,3.3,170.0,106.3,71.7,182.6,3.947,21.0,19.0,9/25/2011,72.290355
106,Nissan,Xterra,54.158,NaN,Car,22.799,3.3,170.0,104.3,70.4,178.0,3.821,19.4,18.0,1/24/2011,69.782944
107,Nissan,Frontier,65.005,NaN,Car,17.890,3.3,170.0,116.1,66.5,196.1,3.217,19.4,18.0,8/27/2011,67.889271
112,Oldsmobile,Bravada,20.017,19.925,Car,31.598,4.3,190.0,107.0,67.8,181.2,4.068,17.5,19.0,9/21/2011,80.511673
113,Oldsmobile,Silhouette,24.361,15.240,Car,25.345,3.4,185.0,120.0,72.2,201.4,3.948,25.0,22.0,6/25/2011,76.096570
116,Plymouth,Voyager,24.155,12.025,Car,18.850,2.4,150.0,113.3,76.8,186.3,3.528,20.0,24.0,4/24/2011,60.951185
123,Pontiac,Montana,39.572,NaN,Car,25.635,3.4,185.0,120.0,72.7,201.3,3.942,25.0,23.0,7/22/2012,76.208440
135,Subaru,Forester,33.028,NaN,Car,20.095,2.5,165.0,99.4,68.3,175.2,3.125,15.9,24.0,9/10/2012,66.762943
140,Toyota,Tacoma,84.087,9.575,Car,11.528,2.4,142.0,103.3,66.5,178.7,2.580,15.1,23.0,8/1/2011,55.297117
141,Toyota,Sienna,65.119,NaN,Car,22.368,3.0,194.0,114.2,73.4,193.5,3.759,20.9,22.0,10/5/2012,78.027219
142,Toyota,RAV4,25.106,13.325,Car,16.888,2.0,127.0,94.9,66.7,163.8,2.668,15.3,27.0,5/6/2011,51.955109
143,Toyota,4Runner,68.411,19.425,Car,22.288,2.7,150.0,105.3,66.5,183.3,3.440,18.5,23.0,3/7/2011,62.355577
144,Toyota,Land Cruiser,9.835,34.080,Car,51.728,4.7,230.0,112.2,76.4,192.5,5.115,25.4,15.0,9/25/2011,102.528984

In [149]:
sales["Vehicle_type"].unique()

array(['Passenger', 'Car'], dtype=object)

In [150]:
sales["Manufacturer"].unique()

array(['Acura', 'Audi', 'BMW', 'Buick', 'Cadillac', 'Chevrolet',
       'Chrysler', 'Dodge', 'Ford', 'Honda', 'Hyundai', 'Infiniti',
       'Jaguar', 'Jeep', 'Lexus', 'Lincoln', 'Mitsubishi', 'Mercury',
       'Mercedes-B', 'Nissan', 'Oldsmobile', 'Plymouth', 'Pontiac',
       'Porsche', 'Saab', 'Saturn', 'Subaru', 'Toyota', 'Volkswagen',
       'Volvo'], dtype=object)

In [151]:
# Q4 How many vehicles are there which are sold with price of 80 or more for passenger
sales[(sales["Price_in_thousands"]>80) & (sales["Vehicle_type"] == 'Passenger')].shape[0]

2

In [152]:
# Q5 List me the vehicle which are sold more than 60k and the price is less than 20k and maufacturer is toyota also save this file in local machine
my_sales = sales[
                    (sales["Sales_in_thousands"] > 60) & 
                    (sales["Price_in_thousands"] < 20) & 
                    (sales["Manufacturer"] == "Toyota")
]
my_sales.to_csv("/Users/rahulmeena/Imarticus/GitHub/IMARTICUS/Datasets/class_exercise/test01.csv")

In [153]:
# Adding new column to the data
sales["Car_area"] = sales["Length"]*sales["Width"]

In [154]:
sales.head()

,Manufacturer,Model,Sales_in_thousands,four_year_resale_value,Vehicle_type,Price_in_thousands,Engine_size,Horsepower,Wheelbase,Width,Length,Curb_weight,Fuel_capacity,Fuel_efficiency,Latest_Launch,Power_perf_factor,Car_area
0,Acura,Integra,16.919,16.360,Passenger,21.50,1.8,140.0,101.2,67.3,172.4,2.639,13.2,28.0,2/2/2012,58.280150,11602.52
1,Acura,TL,39.384,19.875,Passenger,28.40,3.2,225.0,108.1,70.3,192.9,3.517,17.2,25.0,6/3/2011,91.370778,13560.87
2,Acura,CL,14.114,18.225,Passenger,NaN,3.2,225.0,106.9,70.6,192.0,3.470,17.2,26.0,1/4/2012,NaN,13555.20
3,Acura,RL,8.588,29.725,Passenger,42.00,3.5,210.0,114.6,71.4,196.6,3.850,18.0,22.0,3/10/2011,91.389779,14037.24
4,Audi,A4,20.397,22.255,Passenger,23.99,1.8,150.0,102.6,68.2,178.0,2.998,16.4,27.0,10/8/2011,62.777639,12139.60

In [155]:
# Q6 Create a columns Price category, if price is more than 60k make it expensive else normal car
# sales["Price_category"] = "Expensive" if sales["Price_in_thousands"] > 60 else "Normal"
sales["Price_category"] = np.where(sales["Price_in_thousands"] > 60, "Expensive", "Normal")

In [156]:
sales.head(20)

,Manufacturer,Model,Sales_in_thousands,four_year_resale_value,Vehicle_type,Price_in_thousands,Engine_size,Horsepower,Wheelbase,Width,Length,Curb_weight,Fuel_capacity,Fuel_efficiency,Latest_Launch,Power_perf_factor,Car_area,Price_category
0,Acura,Integra,16.919,16.360,Passenger,21.500,1.8,140.0,101.2,67.3,172.4,2.639,13.2,28.0,2/2/2012,58.280150,11602.52,Normal
1,Acura,TL,39.384,19.875,Passenger,28.400,3.2,225.0,108.1,70.3,192.9,3.517,17.2,25.0,6/3/2011,91.370778,13560.87,Normal
2,Acura,CL,14.114,18.225,Passenger,NaN,3.2,225.0,106.9,70.6,192.0,3.470,17.2,26.0,1/4/2012,NaN,13555.20,Normal
3,Acura,RL,8.588,29.725,Passenger,42.000,3.5,210.0,114.6,71.4,196.6,3.850,18.0,22.0,3/10/2011,91.389779,14037.24,Normal
4,Audi,A4,20.397,22.255,Passenger,23.990,1.8,150.0,102.6,68.2,178.0,2.998,16.4,27.0,10/8/2011,62.777639,12139.60,Normal
5,Audi,A6,18.780,23.555,Passenger,33.950,2.8,200.0,108.7,76.1,192.0,3.561,18.5,22.0,8/9/2011,84.565105,14611.20,Normal
6,Audi,A8,1.380,39.000,Passenger,62.000,4.2,310.0,113.0,74.0,198.2,3.902,23.7,21.0,2/27/2012,134.656858,14666.80,Expensive
7,BMW,323i,19.747,NaN,Passenger,26.990,2.5,170.0,107.3,68.4,176.0,3.179,16.6,26.0,6/28/2011,71.191207,12038.40,Normal
8,BMW,328i,9.231,28.675,Passenger,33.400,2.8,193.0,107.3,68.5,176.0,3.197,16.6,24.0,1/29/2012,81.877069,12056.00,Normal
9,BMW,528i,17.527,36.125,Passenger,38.900,2.8,193.0,111.4,70.9,188.0,3.472,18.5,25.0,4/4/2011,83.998724,13329.20,Normal
10,Buick,Century,91.561,12.475,Passenger,21.975,3.1,175.0,109.0,72.7,194.6,3.368,17.5,25.0,11/2/2011,71.181451,14147.42,Normal
11,Buick,Regal,39.350,13.740,Passenger,25.300,3.8,240.0,109.0,72.7,196.2,3.543,17.5,23.0,9/3/2011,95.636703,14263.74,Normal
12,Buick,Park Avenue,27.851,20.190,Passenger,31.965,3.8,205.0,113.8,74.7,206.8,3.778,18.5,24.0,3/23/2012,85.828408,15447.96,Normal
13,Buick,LeSabre,83.257,13.360,Passenger,27.885,3.8,205.0,112.2,73.5,200.0,3.591,17.5,25.0,7/23/2011,84.254526,14700.00,Normal
14,Cadillac,DeVille,63.729,22.525,Passenger,39.895,4.6,275.0,115.3,74.5,207.2,3.978,18.5,22.0,2/23/2012,113.854598,15436.40,Normal
15,Cadillac,Seville,15.943,27.100,Passenger,44.475,4.6,275.0,112.2,75.0,201.0,NaN,18.5,22.0,4/29/2011,115.621358,15075.00,Normal
16,Cadillac,Eldorado,6.536,25.725,Passenger,39.665,4.6,275.0,108.0,75.5,200.6,3.843,19.0,22.0,11/27/2011,113.765874,15145.30,Normal
17,Cadillac,Catera,11.185,18.225,Passenger,31.010,3.0,200.0,107.4,70.3,194.8,3.770,18.0,22.0,9/28/2011,83.483094,13694.44,Normal
18,Cadillac,Escalade,14.785,NaN,Car,46.225,5.7,255.0,117.5,77.0,201.2,5.572,30.0,15.0,4/17/2012,109.509117,15492.40,Normal
19,Chevrolet,Cavalier,145.519,9.250,Passenger,13.260,2.2,115.0,104.1,67.9,180.9,2.676,14.3,27.0,8/17/2011,46.363347,12283.11,Normal

In [157]:
def my_category(x):
    if x>60: return "Expensive"
    elif x>40: return "Less_expensive"
    elif x>20: return "Normal"
    else: return "Affordable"

In [158]:
sales["Price_category_2"] = sales["Price_in_thousands"].apply(my_category)

In [159]:
sales.head()

,Manufacturer,Model,Sales_in_thousands,four_year_resale_value,Vehicle_type,Price_in_thousands,Engine_size,Horsepower,Wheelbase,Width,Length,Curb_weight,Fuel_capacity,Fuel_efficiency,Latest_Launch,Power_perf_factor,Car_area,Price_category,Price_category_2
0,Acura,Integra,16.919,16.360,Passenger,21.50,1.8,140.0,101.2,67.3,172.4,2.639,13.2,28.0,2/2/2012,58.280150,11602.52,Normal,Normal
1,Acura,TL,39.384,19.875,Passenger,28.40,3.2,225.0,108.1,70.3,192.9,3.517,17.2,25.0,6/3/2011,91.370778,13560.87,Normal,Normal
2,Acura,CL,14.114,18.225,Passenger,NaN,3.2,225.0,106.9,70.6,192.0,3.470,17.2,26.0,1/4/2012,NaN,13555.20,Normal,Affordable
3,Acura,RL,8.588,29.725,Passenger,42.00,3.5,210.0,114.6,71.4,196.6,3.850,18.0,22.0,3/10/2011,91.389779,14037.24,Normal,Less_expensive
4,Audi,A4,20.397,22.255,Passenger,23.99,1.8,150.0,102.6,68.2,178.0,2.998,16.4,27.0,10/8/2011,62.777639,12139.60,Normal,Normal

In [160]:
sales["Price_category_2"].value_counts()

Price_category_2
Normal            76
Affordable        57
Less_expensive    16
Expensive          8
Name: count, dtype: int64

In [161]:
pd.Series([4,6,5,3])

0    4
1    6
2    5
3    3
dtype: int64

In [162]:
pd.Series(np.array([5,3,2,42,5,4]), index=np.arange(0,12,2))

0      5
2      3
4      2
6     42
8      5
10     4
dtype: int64

In [163]:
class_dict = {
    'X': ["math", "sci", "eng"],
    'Y': ["math", "sci"],
    'Z': ["sci"]
}

class_Series = pd.Series(class_dict)
class_Series[['Y','Z']]

Y    [math, sci]
Z          [sci]
dtype: object

In [164]:
studentMarks = pd.Series(np.array([55,32,88,45,75]), index=['sophie', 'john', 'jack', 'tim', 'june'])
studentMarks[studentMarks>50]

sophie    55
jack      88
june      75
dtype: int64

In [165]:
sales.head()

,Manufacturer,Model,Sales_in_thousands,four_year_resale_value,Vehicle_type,Price_in_thousands,Engine_size,Horsepower,Wheelbase,Width,Length,Curb_weight,Fuel_capacity,Fuel_efficiency,Latest_Launch,Power_perf_factor,Car_area,Price_category,Price_category_2
0,Acura,Integra,16.919,16.360,Passenger,21.50,1.8,140.0,101.2,67.3,172.4,2.639,13.2,28.0,2/2/2012,58.280150,11602.52,Normal,Normal
1,Acura,TL,39.384,19.875,Passenger,28.40,3.2,225.0,108.1,70.3,192.9,3.517,17.2,25.0,6/3/2011,91.370778,13560.87,Normal,Normal
2,Acura,CL,14.114,18.225,Passenger,NaN,3.2,225.0,106.9,70.6,192.0,3.470,17.2,26.0,1/4/2012,NaN,13555.20,Normal,Affordable
3,Acura,RL,8.588,29.725,Passenger,42.00,3.5,210.0,114.6,71.4,196.6,3.850,18.0,22.0,3/10/2011,91.389779,14037.24,Normal,Less_expensive
4,Audi,A4,20.397,22.255,Passenger,23.99,1.8,150.0,102.6,68.2,178.0,2.998,16.4,27.0,10/8/2011,62.777639,12139.60,Normal,Normal

In [166]:
sales1 = sales.drop(columns=["Car_area", "Price_category_2", "Price_category"])

In [167]:
sales1.head()

,Manufacturer,Model,Sales_in_thousands,four_year_resale_value,Vehicle_type,Price_in_thousands,Engine_size,Horsepower,Wheelbase,Width,Length,Curb_weight,Fuel_capacity,Fuel_efficiency,Latest_Launch,Power_perf_factor
0,Acura,Integra,16.919,16.360,Passenger,21.50,1.8,140.0,101.2,67.3,172.4,2.639,13.2,28.0,2/2/2012,58.280150
1,Acura,TL,39.384,19.875,Passenger,28.40,3.2,225.0,108.1,70.3,192.9,3.517,17.2,25.0,6/3/2011,91.370778
2,Acura,CL,14.114,18.225,Passenger,NaN,3.2,225.0,106.9,70.6,192.0,3.470,17.2,26.0,1/4/2012,NaN
3,Acura,RL,8.588,29.725,Passenger,42.00,3.5,210.0,114.6,71.4,196.6,3.850,18.0,22.0,3/10/2011,91.389779
4,Audi,A4,20.397,22.255,Passenger,23.99,1.8,150.0,102.6,68.2,178.0,2.998,16.4,27.0,10/8/2011,62.777639

In [168]:
sales1.head()

,Manufacturer,Model,Sales_in_thousands,four_year_resale_value,Vehicle_type,Price_in_thousands,Engine_size,Horsepower,Wheelbase,Width,Length,Curb_weight,Fuel_capacity,Fuel_efficiency,Latest_Launch,Power_perf_factor
0,Acura,Integra,16.919,16.360,Passenger,21.50,1.8,140.0,101.2,67.3,172.4,2.639,13.2,28.0,2/2/2012,58.280150
1,Acura,TL,39.384,19.875,Passenger,28.40,3.2,225.0,108.1,70.3,192.9,3.517,17.2,25.0,6/3/2011,91.370778
2,Acura,CL,14.114,18.225,Passenger,NaN,3.2,225.0,106.9,70.6,192.0,3.470,17.2,26.0,1/4/2012,NaN
3,Acura,RL,8.588,29.725,Passenger,42.00,3.5,210.0,114.6,71.4,196.6,3.850,18.0,22.0,3/10/2011,91.389779
4,Audi,A4,20.397,22.255,Passenger,23.99,1.8,150.0,102.6,68.2,178.0,2.998,16.4,27.0,10/8/2011,62.777639

Sorting

In [169]:
sales1.sort_values(by=['Price_in_thousands'], ascending=False, inplace=True)

In [170]:
sales1.head()

,Manufacturer,Model,Sales_in_thousands,four_year_resale_value,Vehicle_type,Price_in_thousands,Engine_size,Horsepower,Wheelbase,Width,Length,Curb_weight,Fuel_capacity,Fuel_efficiency,Latest_Launch,Power_perf_factor
99,Mercedes-B,CL500,0.954,NaN,Passenger,85.500,5.0,302.0,113.6,73.1,196.6,4.115,23.2,20.0,4/11/2011,141.100985
95,Mercedes-B,SL-Class,3.311,58.600,Passenger,82.600,5.0,302.0,99.0,71.3,177.1,4.125,21.1,20.0,3/17/2011,139.982294
126,Porsche,Carrera Cabrio,1.866,67.550,Passenger,74.970,3.4,300.0,92.6,69.5,174.5,3.075,17.0,23.0,7/11/2011,135.914710
125,Porsche,Carrera Coupe,1.280,60.625,Passenger,71.020,3.4,300.0,92.6,69.5,174.5,3.032,17.0,21.0,12/21/2012,134.390975
39,Dodge,Viper,0.916,58.470,Passenger,69.725,8.0,450.0,96.2,75.7,176.7,3.375,19.0,16.0,8/7/2011,188.144323

In [171]:
sales2 = sales.sort_values(by=['Price_in_thousands'])

In [172]:
sales2.head()

,Manufacturer,Model,Sales_in_thousands,four_year_resale_value,Vehicle_type,Price_in_thousands,Engine_size,Horsepower,Wheelbase,Width,Length,Curb_weight,Fuel_capacity,Fuel_efficiency,Latest_Launch,Power_perf_factor,Car_area,Price_category,Price_category_2
26,Chevrolet,Metro,21.855,5.160,Passenger,9.235,1.0,55.0,93.1,62.6,149.4,1.895,10.3,45.0,4/13/2012,23.276272,9352.44,Normal,Affordable
62,Hyundai,Accent,41.184,5.860,Passenger,9.699,1.5,92.0,96.1,65.7,166.7,2.240,11.9,31.0,9/10/2012,36.672284,10952.19,Normal,Affordable
129,Saturn,SL,80.620,9.200,Passenger,10.685,1.9,100.0,102.4,66.4,176.9,2.332,12.1,33.0,8/16/2012,39.986425,11746.16,Normal,Affordable
140,Toyota,Tacoma,84.087,9.575,Car,11.528,2.4,142.0,103.3,66.5,178.7,2.580,15.1,23.0,8/1/2011,55.297117,11883.55,Normal,Affordable
63,Hyundai,Elantra,66.692,7.825,Passenger,11.799,2.0,140.0,100.4,66.9,174.0,2.626,14.5,27.0,11/15/2011,54.590045,11640.60,Normal,Affordable

In [174]:
sales2.head()

,Manufacturer,Model,Sales_in_thousands,four_year_resale_value,Vehicle_type,Price_in_thousands,Engine_size,Horsepower,Wheelbase,Width,Length,Curb_weight,Fuel_capacity,Fuel_efficiency,Latest_Launch,Power_perf_factor,Car_area,Price_category,Price_category_2
26,Chevrolet,Metro,21.855,5.160,Passenger,9.235,1.0,55.0,93.1,62.6,149.4,1.895,10.3,45.0,4/13/2012,23.276272,9352.44,Normal,Affordable
62,Hyundai,Accent,41.184,5.860,Passenger,9.699,1.5,92.0,96.1,65.7,166.7,2.240,11.9,31.0,9/10/2012,36.672284,10952.19,Normal,Affordable
129,Saturn,SL,80.620,9.200,Passenger,10.685,1.9,100.0,102.4,66.4,176.9,2.332,12.1,33.0,8/16/2012,39.986425,11746.16,Normal,Affordable
140,Toyota,Tacoma,84.087,9.575,Car,11.528,2.4,142.0,103.3,66.5,178.7,2.580,15.1,23.0,8/1/2011,55.297117,11883.55,Normal,Affordable
63,Hyundai,Elantra,66.692,7.825,Passenger,11.799,2.0,140.0,100.4,66.9,174.0,2.626,14.5,27.0,11/15/2011,54.590045,11640.60,Normal,Affordable

In [178]:
#Rename a column
sales3 = sales2.rename(columns={"Manufacturer":"Maker"})

In [179]:
sales3.head()

,Maker,Model,Sales_in_thousands,four_year_resale_value,Vehicle_type,Price_in_thousands,Engine_size,Horsepower,Wheelbase,Width,Length,Curb_weight,Fuel_capacity,Fuel_efficiency,Latest_Launch,Power_perf_factor,Car_area,Price_category,Price_category_2
26,Chevrolet,Metro,21.855,5.160,Passenger,9.235,1.0,55.0,93.1,62.6,149.4,1.895,10.3,45.0,4/13/2012,23.276272,9352.44,Normal,Affordable
62,Hyundai,Accent,41.184,5.860,Passenger,9.699,1.5,92.0,96.1,65.7,166.7,2.240,11.9,31.0,9/10/2012,36.672284,10952.19,Normal,Affordable
129,Saturn,SL,80.620,9.200,Passenger,10.685,1.9,100.0,102.4,66.4,176.9,2.332,12.1,33.0,8/16/2012,39.986425,11746.16,Normal,Affordable
140,Toyota,Tacoma,84.087,9.575,Car,11.528,2.4,142.0,103.3,66.5,178.7,2.580,15.1,23.0,8/1/2011,55.297117,11883.55,Normal,Affordable
63,Hyundai,Elantra,66.692,7.825,Passenger,11.799,2.0,140.0,100.4,66.9,174.0,2.626,14.5,27.0,11/15/2011,54.590045,11640.60,Normal,Affordable

## Dataframe

In [181]:
Data = pd.DataFrame({
    "ID": [101,102,103,104, 101,104,107,209],
    "Name": ["Sibbu", "Harry", "John", "Maria", "Sibbu", "John", "Hermoine", "Nebal"],
    "Address": ["Delhi", "noida", "noida", "Gurugram", "Delhi", "Kolkata", "Vijaynagar", "Gaziabad"]
})

In [182]:
Data

    ID      Name     Address
0  101     Sibbu       Delhi
1  102     Harry       noida
2  103      John       noida
3  104     Maria    Gurugram
4  101     Sibbu       Delhi
5  104      John     Kolkata
6  107  Hermoine  Vijaynagar
7  209     Nebal    Gaziabad

In [183]:
Data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   ID       8 non-null      int64
 1   Name     8 non-null      object
 2   Address  8 non-null      object
dtypes: int64(1), object(2)
memory usage: 324.0+ bytes

In [189]:
Data.duplicated().sum()

1

In [192]:
Data["ID"].duplicated().sum()

2

In [193]:
Data1 = Data.drop_duplicates(keep="first")

In [194]:
Data1

    ID      Name     Address
0  101     Sibbu       Delhi
1  102     Harry       noida
2  103      John       noida
3  104     Maria    Gurugram
5  104      John     Kolkata
6  107  Hermoine  Vijaynagar
7  209     Nebal    Gaziabad

In [195]:
superstore.head()

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,City,State,...,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit,Shipping Cost,Order Priority
0,32298,CA-2012-124891,2012-07-31,2012-07-31,Same Day,RH-19495,Rick Hansen,Consumer,New York City,New York,...,TEC-AC-10003033,Technology,Accessories,Plantronics CS510 - Over-the-Head monaural Wir...,2309.650,7,0.0,762.1845,933.57,Critical
1,26341,IN-2013-77878,2013-02-05,2013-02-07,Second Class,JR-16210,Justin Ritter,Corporate,Wollongong,New South Wales,...,FUR-CH-10003950,Furniture,Chairs,"Novimex Executive Leather Armchair, Black",3709.395,9,0.1,-288.7650,923.63,Critical
2,25330,IN-2013-71249,2013-10-17,2013-10-18,First Class,CR-12730,Craig Reiter,Consumer,Brisbane,Queensland,...,TEC-PH-10004664,Technology,Phones,"Nokia Smart Phone, with Caller ID",5175.171,9,0.1,919.9710,915.49,Medium
3,13524,ES-2013-1579342,2013-01-28,2013-01-30,First Class,KM-16375,Katherine Murray,Home Office,Berlin,Berlin,...,TEC-PH-10004583,Technology,Phones,"Motorola Smart Phone, Cordless",2892.510,5,0.1,-96.5400,910.16,Medium
4,47221,SG-2013-4320,2013-11-05,2013-11-06,Same Day,RH-9495,Rick Hansen,Consumer,Dakar,Dakar,...,TEC-SHA-10000501,Technology,Copiers,"Sharp Wireless Fax, High-Speed",2832.960,8,0.0,311.5200,903.04,Critical

In [196]:
superstore["Order ID"].value_counts()

Order ID
CA-2014-100111    14
NI-2014-8880      13
TO-2014-9950      13
IN-2012-41261     13
IN-2013-42311     13
                  ..
ID-2014-68085      1
ID-2012-85221      1
CA-2012-119697     1
CA-2011-151967     1
MX-2012-134460     1
Name: count, Length: 25035, dtype: int64

In [197]:
superstore2 = superstore.drop_duplicates(subset="Order ID")

In [198]:
superstore2["Order ID"].value_counts()

Order ID
CA-2012-124891     1
ES-2013-1622008    1
IN-2014-50228      1
IN-2014-48275      1
ID-2013-33477      1
                  ..
IN-2014-60469      1
TU-2014-1370       1
US-2011-150434     1
IN-2014-17951      1
MX-2012-134460     1
Name: count, Length: 25035, dtype: int64

In [200]:
superstore2.shape

(25035, 24)

### Missing values

In [201]:
sales.isnull().sum()

Manufacturer               0
Model                      0
Sales_in_thousands         0
four_year_resale_value    36
Vehicle_type               0
Price_in_thousands         2
Engine_size                1
Horsepower                 1
Wheelbase                  1
Width                      1
Length                     1
Curb_weight                2
Fuel_capacity              1
Fuel_efficiency            3
Latest_Launch              0
Power_perf_factor          2
Car_area                   1
Price_category             0
Price_category_2           0
dtype: int64

In [202]:
# Dropping all rows wherever we have missing values
sales4 = sales2.dropna()

In [203]:
sales4.shape

(117, 19)

In [ ]:
# Merging

In [205]:
Data

    ID      Name     Address
0  101     Sibbu       Delhi
1  102     Harry       noida
2  103      John       noida
3  104     Maria    Gurugram
4  101     Sibbu       Delhi
5  104      John     Kolkata
6  107  Hermoine  Vijaynagar
7  209     Nebal    Gaziabad

In [213]:
Hosp = pd.DataFrame({
    "Pat_id": [101,104,108,110,101],
    "Dr": ["Vishwas", "Gupta", "Gupta", "Khan", "Vishvas"],
    "Disease": ["Fever", "Brain issue", "Neuro", "Bone", "Cold"]
})

In [214]:
# Inner Join
# left Join
# Right Join
# Outer Join

In [215]:
# pd.merge(left_table, right_table, on="common_column", how = 'inner/left/right/outer')
# pd.merge(left_table, right_table, 
#          left_on="column form left", right_on="column form right", 
#          how = 'inner/left/right/outer')

In [216]:
Data.head()

    ID   Name   Address
0  101  Sibbu     Delhi
1  102  Harry     noida
2  103   John     noida
3  104  Maria  Gurugram
4  101  Sibbu     Delhi

In [217]:
Hosp.head()

   Pat_id       Dr      Disease
0     101  Vishwas        Fever
1     104    Gupta  Brain issue
2     108    Gupta        Neuro
3     110     Khan         Bone
4     101  Vishvas         Cold

In [236]:
left_join_Data_Hosp = pd.merge(Data, Hosp, left_on =["ID"],right_on =["Pat_id"], how= "left")

In [237]:
left_join_Data_Hosp

    ID      Name     Address  Pat_id       Dr      Disease
0  101     Sibbu       Delhi   101.0  Vishwas        Fever
1  101     Sibbu       Delhi   101.0  Vishvas         Cold
2  102     Harry       noida     NaN      NaN          NaN
3  103      John       noida     NaN      NaN          NaN
4  104     Maria    Gurugram   104.0    Gupta  Brain issue
5  101     Sibbu       Delhi   101.0  Vishwas        Fever
6  101     Sibbu       Delhi   101.0  Vishvas         Cold
7  104      John     Kolkata   104.0    Gupta  Brain issue
8  107  Hermoine  Vijaynagar     NaN      NaN          NaN
9  209     Nebal    Gaziabad     NaN      NaN          NaN

In [238]:
right_join_Data_Hosp = pd.merge(Data, Hosp, left_on =["ID"],right_on =["Pat_id"], how= "right")

In [239]:
right_join_Data_Hosp

      ID   Name   Address  Pat_id       Dr      Disease
0  101.0  Sibbu     Delhi     101  Vishwas        Fever
1  101.0  Sibbu     Delhi     101  Vishwas        Fever
2  104.0  Maria  Gurugram     104    Gupta  Brain issue
3  104.0   John   Kolkata     104    Gupta  Brain issue
4    NaN    NaN       NaN     108    Gupta        Neuro
5    NaN    NaN       NaN     110     Khan         Bone
6  101.0  Sibbu     Delhi     101  Vishvas         Cold
7  101.0  Sibbu     Delhi     101  Vishvas         Cold

In [240]:
outer_join_Data_Hosp = pd.merge(Data, Hosp, left_on =["ID"],right_on =["Pat_id"], how= "outer")

In [241]:
outer_join_Data_Hosp

       ID      Name     Address  Pat_id       Dr      Disease
0   101.0     Sibbu       Delhi   101.0  Vishwas        Fever
1   101.0     Sibbu       Delhi   101.0  Vishvas         Cold
2   101.0     Sibbu       Delhi   101.0  Vishwas        Fever
3   101.0     Sibbu       Delhi   101.0  Vishvas         Cold
4   102.0     Harry       noida     NaN      NaN          NaN
5   103.0      John       noida     NaN      NaN          NaN
6   104.0     Maria    Gurugram   104.0    Gupta  Brain issue
7   104.0      John     Kolkata   104.0    Gupta  Brain issue
8   107.0  Hermoine  Vijaynagar     NaN      NaN          NaN
9   209.0     Nebal    Gaziabad     NaN      NaN          NaN
10    NaN       NaN         NaN   108.0    Gupta        Neuro
11    NaN       NaN         NaN   110.0     Khan         Bone

In [ ]:
# Those who exist in hospital but not in database